date12-04-01.org
#+AUTHOR: Yuuhi
#+TITLE: ４月の記録１
#+LANGUAGE: ja
#+HTML: <meta content='no-cache' http-equiv='Pragma' />
#+STYLE: <link rel="stylesheet" type="text/css" href="./org-mode.css">

* 1日
うわあああああああ
** A Normal Formとは

* 2日
** 英文法
- 時制
  - 現在形
  - 進行形
  - 現在形の特殊な用法
  - 現在完了形

- 仮定法
  - 見抜き方
  - 倒置

- 助動詞
  - will
  - 代用表現
  - may

- 不定詞
  - 未来

- 動名詞

- 分詞構文
* 3日
* 4日
* 5日
** Emacsのフォントサイズ変更
"C-x C-+"と"C-x C--"でフォントサイズを変更できる

* 6日
進捗を書かないと迷走する．何かやったつもりで時間が過ぎる
- 何をやるか決めてから，作業を始める
- 本を読むときは区切りまで読んだら感想を書く

** やりたいこととやらないといけないことのまとめ
- 大学でのこと
  - 変換器を書く
  - 論文読む
    - 論文よんだらまとめる
  - 進捗資料をまとめる
    - プレゼンをbeamerで作る
  - セマンティックのことを理解する
  - Haskellの勉強をする
  - 並行処理(コルーチン)のことを調べてまとめる

- その他
  - Androidアプリケーションの設計と実装
    - Twitterクライアント
    - ゲーム
  - GracemonkeyのJSの書き方を覚える
  - Firefox Extensionを作る
    - 情報収集のためのスクリプト
  - クロールのツール作り
  - Luaのことを調べる
  - TODO TOEICの勉強
  - SQLの勉強(MySQLを自鯖で本格運用する)

読んだらまとめる．
作る前にまとめる．

* 7日
** アイデア
- 非実在魔法少女研究会うねうね
- うねうねのこと
  - うねうねってなに？
  - 入会希望の場合
  - 活動日
  - アクセス
  - 研究会規則
  - 連絡先
- メンバー紹介
- イベント
  - 新入生歓迎会
  - スキー合宿
- 作品紹介
- 研究会ログ
- ゲームレビュー
- 読書感想

* 8日
うむ

* 9日
** CSS弄った
- 文字 #dfdfdf
- 背景 #404743
が基本で

** 数学記号(UNICODE)
#+begin_src ruby -n
(0x2200..0x22AF).each { |x|
  print [x].pack("U")
}
#+end_src
- 結果
∀∁∂∃∄∅∆∇∈∉∊∋∌∍∎∏∐∑−∓∔∕∖∗∘∙√∛∜∝∞∟∠∡∢∣∤∥∦∧∨∩∪∫∬∭∮∯∰∱∲∳∴∵∶∷∸∹
∺∻∼∽∾∿≀≁≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩≪≫≬≭≮≯≰≱≲≳≴≵≶≷≸≹≺≻≼≽≾≿
⊀⊁⊂⊃⊄⊅⊆⊇⊈⊉⊊⊋⊌⊍⊎⊏⊐⊑⊒⊓⊔⊕⊖⊗⊘⊙⊚⊛⊜⊝⊞⊟⊠⊡⊢⊣⊤⊥⊦⊧⊨⊩⊪⊫⊬⊭⊮⊯

** AA貼るテスト
#+begin_example
　　　　　 / ￣＼
　　 　 γ"⌒ ヽ ＼＿ノ
　　　　i　ｌ!从ﾉﾘ）　
　　　　| リﾟ ヮﾟﾉﾘ　 れっつにゃー！
　　　 / ﾉ○卯つ
　　／// ゝ　>|ゝヽ
　〃/ﾚﾙ’イ_/ ヽヽヽ
#+end_example

#+begin_example
　　　　 　l^丶
　　　　　 | 　'ﾞ''"'''ﾞ y-―, あ　ふんぐるい　むぐるうなふ　くとぅるう
　　　　　 ﾐ　´ ∀ ｀　　,:'　
　　　　(丶　　　　(丶 ミ　　　いあ　　 　いあ
（（　 　 ﾐ　　　　　　　 ;':　　ﾊ,_,ﾊ 　　ﾊ,_,ﾊ
　　　　　;:　　　　　　 　ﾐ 　';´∀｀'; 　';´∀｀';, ,
　　　　　`:; 　　　　　　,:'　　ｃ　 ｃ.ﾐ'　ｃ　 ｃ.ﾐ
　　　　　　U"ﾞ'''~"＾'丶)　　　u''ﾞ"J 　 u''ﾞ"J


　　　　　　　　　 /^l
　　 ,―-y'"'~"ﾞ´　 |それ　 るるいえ　うがふなぐる　ふたぐん
　　 ヽ　　´ ∀ ｀　 ﾞ':
　　　ﾐ　　.,/)　　　､/) 　　　いあ　　　　いあ
　　　ﾞ,　　 "'　　　´''ﾐ　　　ﾊ,_,ﾊ 　　　ﾊ,_,ﾊ
（（　 ミ　　　　　　　;:'　　,:' ´∀｀';　　,:' ´∀｀';
　　　 ';　　　　　　彡　　::　っ　,っ　 ::　っ　,っ
　　　　(/~"ﾞ''´~"U 　　 ι''"ﾞ''u 　ι''"ﾞ''u 
#+end_example

** 手持ちのMacBookAirのLionでX11アプリケーションが動かない
- 多分以前にRabbitとかmikutterを動かそうとした時にいろいろ弄ってダメにしたような気がするｗｗ
  - 修復の仕方は検討がつかないため，X11アプリケーションを使うことを諦める方向で．．\_(º﹃º｣ ∠)_


** ruby-modeのこと
[C-c C-s]でirb起動，[C-c C-r]で選択範囲の評価．

** ネットワークのこと
「ネットワークはなぜつながるか」戸根 勤(著)などを読んでネットワークの基礎を固める．
- Webブラウザからのメッセージ
  - HTTPリクエスト・メッセージ
  - WebサーバのIPアドレス
  - DNSサーバ
  - プロトコル・スタック
- TCP/IP
  - ソケット
  - サーバ接続
  - データの送受信
  - サーバ切断とソケット抹消
  - IPとイーサネットのパケット送受信
  - UDPプロトコル
- リピータ・ハブ
  - スイッチング・ハブ
  - ルータのパケット中継
  - ルータの機能
- 回線のこと
- サーバ側のLANのこと
  - Webサーバの設置
  - ファイアウォール
  - 負荷分散
  - キャッシュサーバ
  - 配信サービス
- Webサーバの概要
  - サーバ
  - 受信動作
  - レスポンスのこと



** org-mode
C-c C-o（org-open-at-point）でリンク開ける．
C-c &で戻る？

#+begin_example
［ ［*5日］］
#+end_example
で内部リンク

** TOEICの勉強は必須？
なのかどうかは正直分からんが，英語の読み書きは苦にならない程度にできないと，
資料もロクに読めないため
| 回数    | 開催日              | 結果発送            |
|---------+---------------------+---------------------|
| 第170回 | *2012年5月27日（日）* | 2012年6月26日（火） | 

*今度は寝坊しないように*

* 10日

