date12-04-01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>４月の記録１</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="４月の記録１"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-09 15:38:15 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">４月の記録１</h1>


<meta content='no-cache' http-equiv='Pragma' />


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 1日</a>
<ul>
<li><a href="#sec-1-1">1.1 A Normal Formとは</a></li>
</ul>
</li>
<li><a href="#sec-2">2 2日</a>
<ul>
<li><a href="#sec-2-1">2.1 英文法</a></li>
</ul>
</li>
<li><a href="#sec-3">3 3日</a></li>
<li><a href="#sec-4">4 4日</a></li>
<li><a href="#sec-5">5 5日</a>
<ul>
<li><a href="#sec-5-1">5.1 Emacsのフォントサイズ変更</a></li>
</ul>
</li>
<li><a href="#sec-6">6 6日</a>
<ul>
<li><a href="#sec-6-1">6.1 やりたいこととやらないといけないことのまとめ</a></li>
</ul>
</li>
<li><a href="#sec-7">7 7日</a>
<ul>
<li><a href="#sec-7-1">7.1 アイデア</a></li>
</ul>
</li>
<li><a href="#sec-8">8 8日</a></li>
<li><a href="#sec-9">9 9日</a>
<ul>
<li><a href="#sec-9-1">9.1 CSS弄った</a></li>
<li><a href="#sec-9-2">9.2 数学記号(UNICODE)</a></li>
<li><a href="#sec-9-3">9.3 AA貼るテスト</a></li>
<li><a href="#sec-9-4">9.4 手持ちのMacBookAirのLionでX11アプリケーションが動かない</a></li>
<li><a href="#sec-9-5">9.5 ruby-modeのこと</a></li>
<li><a href="#sec-9-6">9.6 ネットワークのこと</a></li>
<li><a href="#sec-9-7">9.7 org-mode</a></li>
<li><a href="#sec-9-8">9.8 TOEICの勉強は必須？</a></li>
</ul>
</li>
<li><a href="#sec-10">10 10日</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 1日</h2>
<div class="outline-text-2" id="text-1">

<p>うわあああああああ
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> A Normal Formとは</h3>
<div class="outline-text-3" id="text-1-1">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2日</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 英文法</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>時制
<ul>
<li>現在形
</li>
<li>進行形
</li>
<li>現在形の特殊な用法
</li>
<li>現在完了形

</li>
</ul>

</li>
<li>仮定法
<ul>
<li>見抜き方
</li>
<li>倒置

</li>
</ul>

</li>
<li>助動詞
<ul>
<li>will
</li>
<li>代用表現
</li>
<li>may

</li>
</ul>

</li>
<li>不定詞
<ul>
<li>未来

</li>
</ul>

</li>
<li>動名詞

</li>
<li>分詞構文
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 3日</h2>
<div class="outline-text-2" id="text-3">

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 4日</h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 5日</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Emacsのフォントサイズ変更</h3>
<div class="outline-text-3" id="text-5-1">

<p>"C-x C-+"と"C-x C&ndash;"でフォントサイズを変更できる
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 6日</h2>
<div class="outline-text-2" id="text-6">

<p>進捗を書かないと迷走する．何かやったつもりで時間が過ぎる
</p><ul>
<li>何をやるか決めてから，作業を始める
</li>
<li>本を読むときは区切りまで読んだら感想を書く
</li>
</ul>



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> やりたいこととやらないといけないことのまとめ</h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li>大学でのこと
<ul>
<li>変換器を書く
</li>
<li>論文読む
<ul>
<li>論文よんだらまとめる
</li>
</ul>

</li>
<li>進捗資料をまとめる
<ul>
<li>プレゼンをbeamerで作る
</li>
</ul>

</li>
<li>セマンティックのことを理解する
</li>
<li>Haskellの勉強をする
</li>
<li>並行処理(コルーチン)のことを調べてまとめる

</li>
</ul>

</li>
<li>その他
<ul>
<li>Androidアプリケーションの設計と実装
<ul>
<li>Twitterクライアント
</li>
<li>ゲーム
</li>
</ul>

</li>
<li>GracemonkeyのJSの書き方を覚える
</li>
<li>Firefox Extensionを作る
<ul>
<li>情報収集のためのスクリプト
</li>
</ul>

</li>
<li>クロールのツール作り
</li>
<li>Luaのことを調べる
</li>
<li>TODO TOEICの勉強
</li>
<li>SQLの勉強(MySQLを自鯖で本格運用する)
</li>
</ul>

</li>
</ul>


<p>
読んだらまとめる．
作る前にまとめる．
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 7日</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> アイデア</h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>非実在魔法少女研究会うねうね
</li>
<li>うねうねのこと
<ul>
<li>うねうねってなに？
</li>
<li>入会希望の場合
</li>
<li>活動日
</li>
<li>アクセス
</li>
<li>研究会規則
</li>
<li>連絡先
</li>
</ul>

</li>
<li>メンバー紹介
</li>
<li>イベント
<ul>
<li>新入生歓迎会
</li>
<li>スキー合宿
</li>
</ul>

</li>
<li>作品紹介
</li>
<li>研究会ログ
</li>
<li>ゲームレビュー
</li>
<li>読書感想
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 8日</h2>
<div class="outline-text-2" id="text-8">

<p>うむ
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 9日</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> CSS弄った</h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>文字 #dfdfdf
</li>
<li>背景 #404743
</li>
</ul>

<p>が基本で
</p>
</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 数学記号(UNICODE)</h3>
<div class="outline-text-3" id="text-9-2">




<pre class="src src-ruby"><span class="linenr">1:  </span>(0x2200..0x22AF).each { |x|
<span class="linenr">2:  </span>  print [x].pack(<span style="color: #ffa07a;">"U"</span>)
<span class="linenr">3:  </span>}
</pre>

<ul>
<li>結果
</li>
</ul>

<p>∀∁∂∃∄∅∆∇∈∉∊∋∌∍∎∏∐∑−∓∔∕∖∗∘∙√∛∜∝∞∟∠∡∢∣∤∥∦∧∨∩∪∫∬∭∮∯∰∱∲∳∴∵∶∷∸∹
∺∻∼∽∾∿≀≁≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩≪≫≬≭≮≯≰≱≲≳≴≵≶≷≸≹≺≻≼≽≾≿
⊀⊁⊂⊃⊄⊅⊆⊇⊈⊉⊊⊋⊌⊍⊎⊏⊐⊑⊒⊓⊔⊕⊖⊗⊘⊙⊚⊛⊜⊝⊞⊟⊠⊡⊢⊣⊤⊥⊦⊧⊨⊩⊪⊫⊬⊭⊮⊯
</p>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> AA貼るテスト</h3>
<div class="outline-text-3" id="text-9-3">




<pre class="example">　　　　　 / ￣＼
　　 　 γ"⌒ ヽ ＼＿ノ
　　　　i　ｌ!从ﾉﾘ）　
　　　　| リﾟ ヮﾟﾉﾘ　 れっつにゃー！
　　　 / ﾉ○卯つ
　　／// ゝ　&gt;|ゝヽ
　〃/ﾚﾙ’イ_/ ヽヽヽ
</pre>



<pre class="example">　　　　 　l^丶
　　　　　 | 　'ﾞ''"'''ﾞ y-―, あ　ふんぐるい　むぐるうなふ　くとぅるう
　　　　　 ﾐ　´ ∀ ｀　　,:'　
　　　　(丶　　　　(丶 ミ　　　いあ　　 　いあ
（（　 　 ﾐ　　　　　　　 ;':　　ﾊ,_,ﾊ 　　ﾊ,_,ﾊ
　　　　　;:　　　　　　 　ﾐ 　';´∀｀'; 　';´∀｀';, ,
　　　　　`:; 　　　　　　,:'　　ｃ　 ｃ.ﾐ'　ｃ　 ｃ.ﾐ
　　　　　　U"ﾞ'''~"＾'丶)　　　u''ﾞ"J 　 u''ﾞ"J


　　　　　　　　　 /^l
　　 ,―-y'"'~"ﾞ´　 |それ　 るるいえ　うがふなぐる　ふたぐん
　　 ヽ　　´ ∀ ｀　 ﾞ':
　　　ﾐ　　.,/)　　　､/) 　　　いあ　　　　いあ
　　　ﾞ,　　 "'　　　´''ﾐ　　　ﾊ,_,ﾊ 　　　ﾊ,_,ﾊ
（（　 ミ　　　　　　　;:'　　,:' ´∀｀';　　,:' ´∀｀';
　　　 ';　　　　　　彡　　::　っ　,っ　 ::　っ　,っ
　　　　(/~"ﾞ''´~"U 　　 ι''"ﾞ''u 　ι''"ﾞ''u 
</pre>


</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 手持ちのMacBookAirのLionでX11アプリケーションが動かない</h3>
<div class="outline-text-3" id="text-9-4">

<ul>
<li>多分以前にRabbitとかmikutterを動かそうとした時にいろいろ弄ってダメにしたような気がするｗｗ
<ul>
<li>修復の仕方は検討がつかないため，X11アプリケーションを使うことを諦める方向で．．_(º﹃º｣ ∠)_
</li>
</ul>

</li>
</ul>



</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> ruby-modeのこと</h3>
<div class="outline-text-3" id="text-9-5">

<p>[C-c C-s]でirb起動，[C-c C-r]で選択範囲の評価．
</p>
</div>

</div>

<div id="outline-container-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> ネットワークのこと</h3>
<div class="outline-text-3" id="text-9-6">

<p>「ネットワークはなぜつながるか」戸根 勤(著)などを読んでネットワークの基礎を固める．
</p><ul>
<li>Webブラウザからのメッセージ
<ul>
<li>HTTPリクエスト・メッセージ
</li>
<li>WebサーバのIPアドレス
</li>
<li>DNSサーバ
</li>
<li>プロトコル・スタック
</li>
</ul>

</li>
<li>TCP/IP
<ul>
<li>ソケット
</li>
<li>サーバ接続
</li>
<li>データの送受信
</li>
<li>サーバ切断とソケット抹消
</li>
<li>IPとイーサネットのパケット送受信
</li>
<li>UDPプロトコル
</li>
</ul>

</li>
<li>リピータ・ハブ
<ul>
<li>スイッチング・ハブ
</li>
<li>ルータのパケット中継
</li>
<li>ルータの機能
</li>
</ul>

</li>
<li>回線のこと
</li>
<li>サーバ側のLANのこと
<ul>
<li>Webサーバの設置
</li>
<li>ファイアウォール
</li>
<li>負荷分散
</li>
<li>キャッシュサーバ
</li>
<li>配信サービス
</li>
</ul>

</li>
<li>Webサーバの概要
<ul>
<li>サーバ
</li>
<li>受信動作
</li>
<li>レスポンスのこと
</li>
</ul>

</li>
</ul>




</div>

</div>

<div id="outline-container-9-7" class="outline-3">
<h3 id="sec-9-7"><span class="section-number-3">9.7</span> org-mode</h3>
<div class="outline-text-3" id="text-9-7">

<p>C-c C-o（org-open-at-point）でリンク開ける．
C-c &amp;で戻る？
</p>



<pre class="example">［ ［*5日］］
</pre>

<p>
で内部リンク
</p>
</div>

</div>

<div id="outline-container-9-8" class="outline-3">
<h3 id="sec-9-8"><span class="section-number-3">9.8</span> TOEICの勉強は必須？</h3>
<div class="outline-text-3" id="text-9-8">

<p>なのかどうかは正直分からんが，英語の読み書きは苦にならない程度にできないと，
資料もロクに読めないため
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">回数</th><th scope="col" class="left">開催日</th><th scope="col" class="left">結果発送</th></tr>
</thead>
<tbody>
<tr><td class="left">第170回</td><td class="left"><b>2012年5月27日（日）</b></td><td class="left">2012年6月26日（火）</td></tr>
</tbody>
</table>


<p>
<b>今度は寝坊しないように</b>
</p>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 10日</h2>
<div class="outline-text-2" id="text-10">


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-09 15:38:15 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
